In [4]:
import os
import pandas as pd
os.chdir(r"C:\Users\user\jupyter\python\preprocessing\데이터")

#### merge 기초

In [7]:
# merge()
# Tip. OSError: Initializing from file failed가 발생하면 engine = "python"을 설정하면 피할 수 있음 (단, 속도 저하 문제가 있음)
df1 = pd.read_csv("merge_실습_employee_group.csv", engine = "python")
df2 = pd.read_csv("merge_실습_employee_hire_date.csv", engine = "python")
# 두개의 dataframe을 확인해주면, 같은 key 값을 가지고 있음을 알 수 있다. 중복 키는 제거하면서 동시에 좌우 데이터를 붙이는 함수이다. key가 같은 series들의 순서가 다를 수도 있다. 
# 같은 내용이지만, key name이 다르면 중복된 키를 제거하지 않는다.이때는 따로 drop 해준다.

In [8]:
df1.head()

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [9]:
df2.head()

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [10]:
merged_df = pd.merge(df1, df2) # 컬럼명이 같아서 키를 employee로 인식함
merged_df.head()  # 순서도 df1과 같아진다.

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### on을 사용하는 경우

In [6]:
merged_df = pd.merge(df1, df2, on = ["employee"])
merged_df.head()

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### left_on, right_on을 사용한 데이터 통합

In [13]:
df1 = pd.read_csv("merge_실습_employee_group.csv", engine = "python")
df2 = pd.read_csv("merge_실습_name_hire_date.csv", engine = "python")
# employee와 name은 사실 같은 내용을 가지고 있음.

In [14]:
df1.head()

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [15]:
df2.head()

   hire_date  name
0       2004  Lisa
1       2008   Bob
2       2012  Jake
3       2014   Sue

In [18]:
# 컬럼명을 바꿔도 똑같이 작동함
merged_df = pd.merge(df1, df2, left_on = "employee", right_on = "name")
merged_df.head() # employee와 name 모두 살아 있어서, 하나를 제거해줘야 함

  employee        group  hire_date  name
0      Bob   Accounting       2008   Bob
1     Jake  Engineering       2012  Jake
2     Lisa  Engineering       2004  Lisa
3      Sue           HR       2014   Sue

In [19]:
merged_df.drop('name', axis = 1, inplace = True)  # 열 삭제
merged_df.head()

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### index를 사용한 데이터 통합

In [20]:
df1 = pd.read_csv("merge_실습_employee_group.csv", engine = "python")
df2 = pd.read_csv("merge_실습_name_hire_date.csv", engine = "python", index_col = "name")

In [21]:
df2.head()

      hire_date
name
Lisa       2004
Bob        2008
Jake       2012
Sue        2014

In [22]:
merged_df = pd.merge(df1, df2, left_on = "employee", right_index = True)
#데이터 하나는 index로 key 내용을 가지고 있었기 때문에 그에 맞게 설정해준다. 이때는 index 열이 컬럼이 아니였기 때문에 따로 열이 추가되지는 않는다.

In [23]:
merged_df.head()

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014